htmls/archlinux_install_notice.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-02-27 Wed 00:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Arch安装注意事项</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ThankFly" />
<meta name="description" content="change to a wonderful system"
 />
<meta name="keywords" content="linux,system" />
<link rel="stylesheet" type="text/css" href="../media/stylesheets/org.css">
</head>
<body>
<div id="content">
<h1 class="title">Arch安装注意事项</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org921020e">1. lightdm的使用</a></li>
<li><a href="#org89c586a">2. 输入法无法切换和应用字体出现空格</a></li>
<li><a href="#org42a7844">3. 安装kde-base及相关依赖包</a></li>
<li><a href="#org247e689">4. 进入不了kde桌面</a></li>
</ul>
</div>
</div>

<div id="outline-container-org921020e" class="outline-2">
<h2 id="org921020e"><span class="section-number-2">1</span> lightdm的使用</h2>
<div class="outline-text-2" id="text-1">
<p>
  /etc/lightdm/lightdm.conf是主体配置文件,可以把greet－xsession设置成自己想要的
greeter.有不同的登录界面可以选择,比如lightdm-gtk-greeter,lightdm-webkit(2)-greeter,
试了半天发现webkit2这个主题比较酷炫的greeter并不能用,感到很无奈,只好用着lightdm-gtk-greeter.
当然这个gtk的登录界面也可以进行简单配置的.
</p>
</div>
</div>

<div id="outline-container-org89c586a" class="outline-2">
<h2 id="org89c586a"><span class="section-number-2">2</span> 输入法无法切换和应用字体出现空格</h2>
<div class="outline-text-2" id="text-2">
<p>
  输入法无法切换这一点纠结了我很久,之前一直用的ubuntu下的搜狗输入法,现在也仍装了它.
arch下安装软件还是比较方便的,但是一直切换不出来搜狗输入法让人很无奈,搜了半天最后发
现似乎是在配置文件里加入
</p>


<div class="org-src-container">
<pre class="src src-sh"><span style="color: #B71C1C;">export</span> <span style="color: #EF6C00;">LANG</span>=zh_CN.UTF-8
<span style="color: #B71C1C;">export</span> <span style="color: #EF6C00;">LANGUAGE</span>=zh_CN:en_US
<span style="color: #B71C1C;">export</span> <span style="color: #EF6C00;">LC_CTYPE</span>=en_US.UTF-8

<span style="color: #B71C1C;">export</span> <span style="color: #EF6C00;">XIM</span>=<span style="color: #689f38;">"fcitx"</span>
<span style="color: #B71C1C;">export</span> <span style="color: #EF6C00;">XIM_PROGRAM</span>=<span style="color: #689f38;">"fcitx"</span>
<span style="color: #B71C1C;">export</span> <span style="color: #EF6C00;">XMODIFIERS</span>=<span style="color: #689f38;">"@im=fcitx"</span>&#65348;
<span style="color: #B71C1C;">export</span> <span style="color: #EF6C00;">GTK_IM_MODULE</span>=<span style="color: #689f38;">"fcitx"</span>
<span style="color: #B71C1C;">export</span> <span style="color: #EF6C00;">QT_IM_MODULE</span>=<span style="color: #689f38;">"fcitx"</span>

</pre>
</div>

<p>
这些配置,然而,也不知道该加入哪个配置文件,/etc/locale.conf,~/.xinitrc,~/.xprofile,
/etc/environment都加了最后不知怎么就可以调用了,只是同时也发现clion乱码了,很失望:(
</p>


<p>
至于乱码是怎么解决的呢?
</p>
</div>
</div>

<div id="outline-container-org42a7844" class="outline-2">
<h2 id="org42a7844"><span class="section-number-2">3</span> 安装kde-base及相关依赖包</h2>
<div class="outline-text-2" id="text-3">
<p>
 安装了kde的字体工具,基本的字体文件之后,一看发现之前有空格的应用现在都正常了.  :)
不得不说kde这个系列还是很不错的,只是电脑性能太差了,很容易卡.
</p>
</div>
</div>

<div id="outline-container-org247e689" class="outline-2">
<h2 id="org247e689"><span class="section-number-2">4</span> 进入不了kde桌面</h2>
<div class="outline-text-2" id="text-4">
<p>
  看archwiki上说kde5用sddm比较好的意思(也可能是我理解错了),最后偶然把lightdmf关了,换成
了gdm,竟然一下可以进入plasma界面了.恩,然后体验了一把gnome和kde的卡,对比了一下发现了我
xfce的流畅简洁.    :)
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2016-10-15</p>
<p class="author">Author: ThankFly</p>
<p class="date">Created: 2019-02-27 Wed 00:38</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>